####################################################################################
#
# Generated by eda_pt_script.tcl	#1
#              eda_pt_generate.tcl	#1
#              in d:/altera/81/quartus/common/tcl/internal/eda_pt/.
#
# Quartus:  Version 8.1 Build 163 10/28/2008 SJ Web Edition
#
# Project:  8X300_gen2
# Revision: 8X300
# Device:   EP2C5T144C8
#
# Date: Thu May 21 5:04:04 PM Central Daylight Time 2020
#
# Copyright (C) 1991-2008 Altera Corporation
#
####################################################################################


##################
# Header Section #
##################

# This Tcl script should be used for PrimeTime (Verilog) only
set report_default_significant_digits 3
set hierarchy_separator .
set quartus_root "d:/altera/81/quartus/"
set search_path [list . [format "%s%s" $quartus_root "eda/synopsys/primetime/lib"] ]
set link_path [list * cycloneii_lcell_comb_lib.db cycloneii_lcell_ff_lib.db cycloneii_asynch_io_lib.db bb2_lib.db cycloneii_ram_internal_lib.db cycloneii_memory_register_lib.db cycloneii_memory_addr_register_lib.db cycloneii_clk_delay_ctrl_lib.db cycloneii_clk_delay_cal_ctrl_lib.db cycloneii_mac_out_lib.db cycloneii_mac_mult_internal_lib.db cycloneii_mac_register_lib.db cycloneii_pll_lib.db  alt_vtl.db]
read_verilog cycloneii_all_pt.v


########################
# Design Entry Section #
########################

read_verilog 8x300.vo
current_design N8X300
link
## Set variable timing_propagate_single_condition_min_slew to false only for versions 2004.06 and earlier
regexp {([1-9][0-9][0-9][0-9]\.[0-9][0-9])} $sh_product_version dummy version
if { [string compare "2004.06" $version ] != -1 } {
	set timing_propagate_single_condition_min_slew false
}
set_operating_conditions -analysis_type single
## Use "slow" for slow corner or "fast" for fast corner
set corner slow
if [string equal -nocase $corner slow] {
	read_sdf 8x300_v.sdo
} elseif [string equal -nocase $corner fast] {
	read_sdf 8x300_v_fast.sdo
}


######################
# Timing Constraints #
######################

source 8X300.collections.sdc
source 8X300.constraints.sdc

########################
# Output Pins Loadings #
########################

# Pin A[0] ( Location = 65 )
set_load -pin_load 0 [get_ports { {A[0]} } ]
# Pin A[10] ( Location = 60 )
set_load -pin_load 0 [get_ports { {A[10]} } ]
# Pin A[11] ( Location = 59 )
set_load -pin_load 0 [get_ports { {A[11]} } ]
# Pin A[12] ( Location = 64 )
set_load -pin_load 0 [get_ports { {A[12]} } ]
# Pin A[1] ( Location = 125 )
set_load -pin_load 0 [get_ports { {A[1]} } ]
# Pin A[2] ( Location = 51 )
set_load -pin_load 0 [get_ports { {A[2]} } ]
# Pin A[3] ( Location = 53 )
set_load -pin_load 0 [get_ports { {A[3]} } ]
# Pin A[4] ( Location = 126 )
set_load -pin_load 0 [get_ports { {A[4]} } ]
# Pin A[5] ( Location = 55 )
set_load -pin_load 0 [get_ports { {A[5]} } ]
# Pin A[6] ( Location = 58 )
set_load -pin_load 0 [get_ports { {A[6]} } ]
# Pin A[7] ( Location = 57 )
set_load -pin_load 0 [get_ports { {A[7]} } ]
# Pin A[8] ( Location = 63 )
set_load -pin_load 0 [get_ports { {A[8]} } ]
# Pin A[9] ( Location = 52 )
set_load -pin_load 0 [get_ports { {A[9]} } ]
# Pin IO_SC ( Location = 135 )
set_load -pin_load 0 [get_ports { IO_SC } ]
# Pin IO_WC ( Location = 72 )
set_load -pin_load 0 [get_ports { IO_WC } ]
# Pin IO_n_LB_r ( Location = 139 )
set_load -pin_load 0 [get_ports { IO_n_LB_r } ]
# Pin IO_n_LB_w ( Location = 48 )
set_load -pin_load 0 [get_ports { IO_n_LB_w } ]
# Pin IO_n_RB_r ( Location = 136 )
set_load -pin_load 0 [get_ports { IO_n_RB_r } ]
# Pin IO_n_RB_w ( Location = 47 )
set_load -pin_load 0 [get_ports { IO_n_RB_w } ]
# Pin n_IV_out[0] ( Location = 118 )
set_load -pin_load 0 [get_ports { {n_IV_out[0]} } ]
# Pin n_IV_out[1] ( Location = 25 )
set_load -pin_load 0 [get_ports { {n_IV_out[1]} } ]
# Pin n_IV_out[2] ( Location = 132 )
set_load -pin_load 0 [get_ports { {n_IV_out[2]} } ]
# Pin n_IV_out[3] ( Location = 133 )
set_load -pin_load 0 [get_ports { {n_IV_out[3]} } ]
# Pin n_IV_out[4] ( Location = 122 )
set_load -pin_load 0 [get_ports { {n_IV_out[4]} } ]
# Pin n_IV_out[5] ( Location = 26 )
set_load -pin_load 0 [get_ports { {n_IV_out[5]} } ]
# Pin n_IV_out[6] ( Location = 129 )
set_load -pin_load 0 [get_ports { {n_IV_out[6]} } ]
# Pin n_IV_out[7] ( Location = 134 )
set_load -pin_load 0 [get_ports { {n_IV_out[7]} } ]
